# Создайте несколько переменных разных типов.
# Проверьте к какому типу относятся созданные переменные.
a = 1
b = 1.23
c ='text'
d = False
e = [1,'sdf', 34, 4.3]
print(type(a), type(b), type(c), type(d), type(e))
